git 사용 예시를 위해 문제를 풀었다고 가정합니다

ex001 풀었어요
ex002 풀었어요
ex003 풀었어요
ex004 풀었어요
ex005 풀었어요
ex006 풀었어요
ex007 풀었어요
ex008 풀었어요
ex009 풀었어요
ex010 풀었어요
ex011 풀었어요
ex012 풀었어요
ex013 풀었어요
ex014 풀었어요
ex015 풀었어요

원래는 day마다 파일을 구분하라고 요청했었는데.. 한 파일에 쭉 이어서 하시더라구요.
그래서 저도 그렇게 day2 예제를 만듭니다.

ex016 풀었어요
ex017 풀었어요
ex018 풀었어요
ex019 풀었어요
ex020 풀었어요
ex021 풀었어요
ex022 풀었어요
ex023 풀었어요
ex024 풀었어요
ex025 풀었어요
ex026 풀었어요
ex027 풀었어요
ex028 풀었어요
ex029 풀었어요
ex030 풀었어요

day3를 풉니다. 지금 이 시점에서 day1의 수정 사항은 보이지 않습니다.
믿음이 부족한 자여... 불안해 하지 마세요.
문제를 이어서 푸세요.

ex031 풀었어요
ex032 풀었어요
ex033 풀었어요
ex034 풀었어요
ex035 풀었어요
ex036 풀었어요
ex037 풀었어요
ex038 풀었어요
ex039 풀었어요
ex040 풀었어요
ex041 풀었어요
ex042 풀었어요
ex043 풀었어요
ex044 풀었어요
ex045 풀었어요
